<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [11]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [12]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.19.2
Pandas:  1.1.3

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [13]:
# wrong:
bikes = pd.read_table('bikeshare.csv', header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('bikeshare.csv', header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('bikeshare.csv', header = 0)
print(bikes.head())

                                                   0
0  instant,dteday,season,yr,mnth,hr,holiday,weekd...
1  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
2  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
3  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
4  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...

  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0,3,13,16
0  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
1  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
2  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
3  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...
4  6,2011-01-01,1,0,1,5,0,6,0,2,0.24,0.2576,0.75,...

  instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
1  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
2  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
3  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
4  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...

?:
ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [14]:
bikes = pd.read_csv('bikeshare.csv', header=None)
bikes.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
0,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
1,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0,3,13,16
2,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0,8,32,40
3,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0,5,27,32
4,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0,3,10,13

In [15]:
bikes = pd.read_csv('bikeshare.csv', header=1)
bikes.head()

,1,2011-01-01,1.1,0,1.2,0.1,0.2,6,0.3,1.3,0.24,0.2879,0.81,0.4,3,13,16
0,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0000,8,32,40
1,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0000,5,27,32
2,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0000,3,10,13
3,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0000,0,1,1
4,6,2011-01-01,1,0,1,5,0,6,0,2,0.24,0.2576,0.75,0.0896,0,1,1

In [16]:
bikes = pd.read_csv('bikeshare.csv', header=0)
bikes.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [17]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [18]:
df = pd.read_excel('Iris.xls', sheet_name = 'Data')
df.head()

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For ecxample, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [101]:
#ANSWER
df1=pd.read_excel('Iris.xls', sheet_name = 'Data', usecols=['Species_No','Petal_width',\
                                                            'Petal_length','Sepal_width','Sepal_length'])
df1.head(3)

   Species_No  Petal_width  Petal_length  Sepal_width  Sepal_length
0           1          0.2           1.4          3.5           5.1
1           1          0.2           1.4          3.0           4.9
2           1          0.2           1.3          3.2           4.7

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [20]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

Empty DataFrame
Columns: [time, latitude, longitude, depth, mag, magType, nst, gap, dmin, rms, net, id, updated, place, type, horizontalError, depthError, magError, magNst, status, locationSource, magSource]
Index: []

[0 rows x 22 columns]

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [21]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'

df = pd.read_html(url)
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [22]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [23]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [24]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [25]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [26]:
#ANSWER
bikes.index.values

array([    0,     1,     2, ..., 17376, 17377, 17378], dtype=int64)

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [27]:
#ANSWER
bikes['dteday']

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

In [28]:
bikes[['dteday']]

           dteday
0      2011-01-01
1      2011-01-01
2      2011-01-01
3      2011-01-01
4      2011-01-01
...           ...
17374  2012-12-31
17375  2012-12-31
17376  2012-12-31
17377  2012-12-31
17378  2012-12-31

[17379 rows x 1 columns]

How would we use object notation to show the first 4 rows of `atemp`?

In [29]:
#ANSWER
bikes[['atemp']].head(4)

    atemp
0  0.2879
1  0.2727
2  0.2727
3  0.2879

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [30]:
import pandas as pd
bikes = pd.read_csv('bikeshare.csv')
bikes.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

In [31]:
bikes[0,0]

KeyError: (0, 0)

In [32]:
bikes[[0,0]]

KeyError: "None of [Int64Index([0, 0], dtype='int64')] are in the [columns]"

In [33]:
E: bikes[[0]]
E: bikes[0]
E: bikes[0,0]
E: bikes[[0,0]]

KeyError: "None of [Int64Index([0], dtype='int64')] are in the [columns]"

What is the correct way to access the 1st row of the DataFrame by its index?

In [6]:
#ANSWER
bikes.loc[[0]]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16

What is the correct way to access the 2nd column of the DataFrame by its index?

In [38]:
#ANSWER
bikes.loc[:,'dteday']

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER:

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [605]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [606]:
#ANSWER
bikes.isnull().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [607]:
#ANSWER
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
dtypes: float64(4), int64(12), object(1)
memory usage: 2.3+ MB

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER: Marking a data point as invalid.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [608]:
#ANSWER
# means Not A Number

Apply the Pandas `isna` function to the following data objects:

In [609]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [610]:
#ANSWER : 1 NA
ps = np.array([x,y])
df = pd.DataFrame(ps)
df.isna()

       0
0  False
1   True

In [611]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [612]:
#ANSWER : 2 NA
df1= pd.DataFrame(array)
df1.isna()

       0      1      2
0  False   True  False
1  False  False   True

How is the pandas I/O parameter `na_values` used?

? ANSWER:

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [613]:
#ANSWER: 4 seasons
bikes['season'].unique()

array([1, 2, 3, 4], dtype=int64)

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [48]:
#ANSWER
print(f" range of instant is: {bikes['instant'].min()} ---> {bikes['instant'].max()}")

 range of instant is: 1 ---> 17379

In [1]:
import datetime
dateday_list=bikes['dteday'].astype(str).values.tolist()
date_acc=[]
for i in dateday_list:
    dateday_obj = datetime.datetime.strptime(i, '%Y-%m-%d').date()
    date_acc.append(dateday_obj)
    date_acc   
bikes['dteday']=pd.Series(date_acc)

print(bikes['dteday'].min(),'--->', bikes['dteday'].max())

NameError: name 'bikes' is not defined

In [46]:
print(f" range of windspeed is: {bikes['windspeed'].min()} ---> {bikes['windspeed'].max()}")

 range of windspeed is: 0.0 ---> 0.8507

Compute and print the overall minimum and maximum of the numeric data columns:

In [52]:
bikes_min, bikes_max = [bikes.min(), bikes.max()]
print(f"Min values: {bikes_min}")
print()
print(f"Max values: {bikes_max}")

Min values: instant                1
dteday        2011-01-01
season                 1
yr                     0
mnth                   1
hr                     0
holiday                0
weekday                0
workingday             0
weathersit             1
temp                0.02
atemp                  0
hum                    0
windspeed              0
casual                 0
registered             0
cnt                    1
dtype: object

Max values: instant            17379
dteday        2012-12-31
season                 4
yr                     1
mnth                  12
hr                    23
holiday                1
weekday                6
workingday             1
weathersit             4
temp                   1
atemp                  1
hum                    1
windspeed         0.8507
casual               367
registered           886
cnt                  977
dtype: object

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [53]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [54]:
#ANSWER
bikes['atemp'].quantile([.1,.25,.5,.75,.9])

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [55]:
type(bikes['atemp'])

pandas.core.series.Series

In [56]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
13128,13129,2012-07-06,3,1,7,5,0,5,1,1,0.74,0.6970,0.66,0.1940,4,31,35
14155,14156,2012-08-18,3,1,8,0,0,6,0,2,0.64,0.5758,0.83,0.2239,6,99,105
12035,12036,2012-05-21,2,1,5,16,0,1,1,2,0.64,0.6061,0.73,0.2537,46,269,315
16774,16775,2012-12-06,4,1,12,17,0,4,1,1,0.30,0.3182,0.45,0.1045,31,586,617
5185,5186,2011-08-08,3,0,8,23,0,1,1,1,0.74,0.6970,0.66,0.1045,19,53,72

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [57]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)  
atemp_level.value_counts()

(0.25, 0.5]       7507
(0.5, 0.75]       7223
(-0.001, 0.25]    1952
(0.75, 1.0]        697
Name: atemp, dtype: int64

What is `atemp_level`?

In [59]:
#ANSWER categorized data
atemp_level

0        (0.25, 0.5]
1        (0.25, 0.5]
2        (0.25, 0.5]
3        (0.25, 0.5]
4        (0.25, 0.5]
            ...
17374    (0.25, 0.5]
17375    (0.25, 0.5]
17376    (0.25, 0.5]
17377    (0.25, 0.5]
17378    (0.25, 0.5]
Name: atemp, Length: 17379, dtype: category
Categories (4, interval[float64]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

Here is a random sample of `atemp_level`:

In [60]:
atemp_level.sample(5)

15207    (0.25, 0.5]
8680     (0.25, 0.5]
6516     (0.25, 0.5]
6449     (0.25, 0.5]
5272     (0.5, 0.75]
Name: atemp, dtype: category
Categories (4, interval[float64]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [61]:
bikes['atemp_level'] = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
bikes['atemp_level'].sample(5)   
bikes.head(3)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,atemp_level
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,mild
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,mild
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,mild

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [62]:
bikes['season_2']=bikes['atemp_level'].apply(lambda x: 1 if x=='mild' else 0)
bikes.head(3)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,atemp_level,season_2
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,mild,1
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,mild,1
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,mild,1

In [64]:
#ANSWER
bikes['season_2'].value_counts()

0    9872
1    7507
Name: season_2, dtype: int64

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [65]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )

In [66]:
a.shape
a

array([0., 0., 0.])

In [67]:
b.shape
b

array([[1., 1., 1.]])

In [68]:
c.shape
c

array([[[1, 3, 2, 5],
        [9, 9, 2, 5],
        [1, 4, 7, 2]],

       [[5, 4, 2, 9],
        [7, 5, 1, 3],
        [9, 1, 3, 8]]])

In [69]:
d.shape

(4,)

In [70]:
e.shape
e

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [71]:
# Cleaning Data
import pandas as pd
import numpy as np
df = pd.read_csv('rock.csv')
df.head()

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

In [72]:
dff1=dff2=dff3=dff4=dff5=df.copy()

## Load Data

Load rock.csv and clean the dataset.

In [73]:
df = pd.read_csv('rock.csv')

## Check Column Names

Check column names and clean.

In [74]:
import pandas as pd
import numpy as np
df = pd.read_csv('rock.csv')
df.head()
df.rename(columns={'First?':'First','Year?':'Year','F*G':'FG'}, inplace=True)

In [75]:
df.columns=  [i.replace(' ','_') for i in df.columns.str.lower()]
df.columns

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'fg'],
      dtype='object')

## Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [76]:
df['release_year'].isnull().sum()

577

In [77]:
df['release_year'].fillna(0,inplace=True)
df['release_year'].isnull().sum()

0

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [78]:
df.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

In [79]:
(df['release_year']==0).value_counts()

False    1653
True      577
Name: release_year, dtype: int64

In [80]:
df.shape

(2230, 8)

In [81]:
df['release_year'].str.isdigit().value_counts()

True     1652
False       1
Name: release_year, dtype: int64

In [82]:
df[df['release_year']=='SONGFACTS.COM']

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
1504,Bullfrog Blues,Rory Gallagher,SONGFACTS.COM,Bullfrog Blues by Rory Gallagher,1,1,1,1

In [84]:
df.loc[1504,'release_year']=1972

In [89]:
med=df['release_year'].median()
df['release_year'].replace({0:med}, inplace=True)
df['release_year']=df['release_year'].astype('int32')
df.head()
#print(med)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,1973,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [90]:
df['artist_clean'].replace({'.38 Special':'38 Special'}, inplace=True)
df.loc[1504,'release_year']= 1972
max_=[]
min_=[]
for i in range(len(df.columns)):
    max_.append(df.iloc[:,i].max())
    min_.append(df.iloc[:,i].min())

print(f" Max: {max_}")
print(f" Min: {min_}")

 Max: ['Ziggy Stardust', 'a-ha', 2014, 'Ziggy Stardust by David Bowie', 1, 1, 142, 142]
 Min: ['#9 Dream', '10cc', 1071, '#9 Dream by John Lennon', 1, 0, 0, 0]

In [98]:
print(f"song_clean: min value is {df['song_clean'].min()},  max value is {df['song_clean'].max()}")
print(f"artist_clean: min value is {df['artist_clean'].min()},  max value is {df['artist_clean'].max()}")
print(f"release_year: min value is {df['release_year'].min()},  max value is {df['release_year'].max()}")
print(f"combined: min value is {df['combined'].min()},  max value is {df['combined'].max()}")
print(f"first: min value is {df['first'].min()},  max value is {df['first'].max()}")
print(f"year: min value is {df['year'].min()},  max value is {df['year'].max()}")
print(f"playcount: min value is {df['playcount'].min()},  max value is {df['playcount'].max()}")
print(f"fg: min value is {df['fg'].min()},  max value is {df['fg'].max()}")

song_clean: min value is #9 Dream,  max value is Ziggy Stardust
artist_clean: min value is 10cc,  max value is a-ha
release_year: min value is 1071,  max value is 2014
combined: min value is #9 Dream by John Lennon,  max value is Ziggy Stardust by David Bowie
first: min value is 1,  max value is 1
year: min value is 0,  max value is 1
playcount: min value is 0,  max value is 142
fg: min value is 0,  max value is 142

## Write Some Functions

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [750]:
def song(x):
    if df.loc[x,'release_year']<1970:
        print('before 1970')
        return df.loc[x,['song_clean','artist_clean']]
    else:
        print('after 1970')
        return df.loc[x,['song_clean','artist_clean']]
    
song(14)

after 1970

song_clean      Dirty Deeds Done Dirt Cheap
artist_clean                          AC/DC
Name: 14, dtype: object

## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [105]:
df1=df2=df3=df.copy()
df.head()

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,Caught Up in You,38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,38 Special,1973,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

In [106]:

def floats1(y):
    len_col= len(y.columns)
    len_row=len(y.index)

    for i in range(len_col):
        for j in range(len_row):
        
            if type(y.iloc[j,i]) ==np.int64 or type(y.iloc[j,i]) ==np.int32:
                y.iloc[j,i].astype('float')
            else:
                y.iloc[j,i]=np.nan
        
    return y.head()

floats1(df)

  song_clean artist_clean  release_year combined  first  year  playcount  fg
0        NaN          NaN          1982      NaN      1     1         82  82
1        NaN          NaN          1973      NaN      1     0          3   0
2        NaN          NaN          1981      NaN      1     1         85  85
3        NaN          NaN          1980      NaN      1     1         18  18
4        NaN          NaN          1975      NaN      1     1          1   1

In [107]:
# x is a variable for dataframe
def floats(x):
    len_col= len(x.columns)    
    for i in range(len_col):
        x.iloc[:,i]=pd.to_numeric(x.iloc[:,i], errors='coerce')
        
    return x.head()

floats(df)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,1973,NaN,1,0,3,0
2,NaN,NaN,1981,NaN,1,1,85,85
3,NaN,NaN,1980,NaN,1,1,18,18
4,NaN,NaN,1975,NaN,1,1,1,1

## Apply these functions to your dataset

## Describe the new float-only DataFrame.

In [108]:
df1.describe()
df1

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,Caught Up in You,38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,38 Special,1973,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,1973,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

In [109]:
df3=df.copy()
df3.head(2)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,1973,NaN,1,0,3,0

In [110]:
df3.iloc[:,0]

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
2225   NaN
2226   NaN
2227   NaN
2228   NaN
2229   NaN
Name: song_clean, Length: 2230, dtype: float64

In [111]:
df2.head(3)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,Caught Up in You,38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,38 Special,1973,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85

In [112]:
# x is a variable for dataframe
def floats(x):
    len_col= len(x.columns)    
    for i in range(len_col):
        x.iloc[:,i]=pd.to_numeric(x.iloc[:,i], errors='coerce')
        
    return x.head()

floats(df2)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,1973,NaN,1,0,3,0
2,NaN,NaN,1981,NaN,1,1,85,85
3,NaN,NaN,1980,NaN,1,1,18,18
4,NaN,NaN,1975,NaN,1,1,1,1

In [113]:
def floats1(x):
    x=x.apply(pd.to_numeric, errors='coerce')
    return x

floats1(df1)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982,NaN,1,1,82,82
1,NaN,NaN,1973,NaN,1,0,3,0
2,NaN,NaN,1981,NaN,1,1,85,85
3,NaN,NaN,1980,NaN,1,1,18,18
4,NaN,NaN,1975,NaN,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,NaN,NaN,1973,NaN,1,0,1,0
2226,NaN,NaN,1981,NaN,1,1,32,32
2227,NaN,NaN,1975,NaN,1,1,109,109
2228,NaN,NaN,1983,NaN,1,1,1,1
2229,NaN,NaN,1973,NaN,1,1,2,2

In [689]:
dff= pd.DataFrame({'col1':[2,4,2,5],'col2': [3,4,2,4],'col3':[4,3,6,8]})
dff1=dff2=dff.copy()
dff2

   col1  col2  col3
0     2     3     4
1     4     4     3
2     2     2     6
3     5     4     8

In [694]:
#df4.interpolate(method='ffill',inplace=True)
dff2['col4']=dff2['col1'].apply(lambda x: x*dff2['col3'])
dff2

   col1  col2  col3  col4
0     2     3     4     8
1     4     4     3    16
2     2     2     6     8
3     5     4     8    20

In [697]:
dff2.apply(lambda x:dff2['col1']*dff2['col4'])

   col1  col2  col3  col4
0    16    16    16    16
1    64    64    64    64
2    16    16    16    16
3   100   100   100   100

>



---



---



> > > > > > > > > © 2021 Institute of Data


---



---